[Language]
Product_Name=EaseUS Todo PCTrans
Main_Title=Vielen Dank für Ihre Verwendung
Sub_Title=Wie würden Sie Ihre Nutzererfahrung bewerten?
Terrible=Furchtbar
Poor=Schlecht
Good=Gut
Great=Großartig
Excellent=Ausgezeichnet
Never_Ask_Again=Nicht nochmal fragen
Rate_Now=Jetzt bewerten
Feedback_Text_Tips=Schreiben Sie einen Kommentar.
Feedback_Length_Tips=Maximal 500 Zeichen. Für mehr Feedback wenden Sie sich bitte an support@easeus.com.
